{
    "jokes": [
      "Why do programmers prefer dark mode? Because light attracts bugs.",
      "A programmer’s favorite hangout place is Stack Overflow.",
      "Why did the developer go broke? Because he used up all his cache.",
      "I’m not a great programmer, I’m just a good programmer with great habits.",
      "Why do Java developers wear glasses? Because they don’t C#.",
      "The problem with the computer industry is that it's always growing. And growing. And growing. But it never gets any smarter.",
      "How many programmers does it take to change a light bulb? None. It’s a hardware problem.",
      "Why don’t programmers like nature? It has too many bugs.",
      "I have a joke about UDP, but I’m not sure if you’ll get it.",
      "Why was the developer so calm during the crisis? Because he knew how to handle exceptions.",
      "If you’re not part of the solution, you’re part of the problem.",
      "There are only two hard things in computer science: cache invalidation, naming things, and off-by-one errors.",
      "What’s the object-oriented way to become wealthy? Inheritance.",
      "What do you call a programmer from Finland? Nerdic.",
      "A database walks into a bar and asks for a drink. The bartender says, ‘Sorry, we don’t serve your type.’",
      "Why do Python programmers prefer snake_case? Because it’s easier to handle exceptions.",
      "Programmers are tools for converting caffeine into code.",
      "I told my computer I needed a break, and now it won’t stop sending me KitKat ads.",
      "What do you call an API that’s always working? A miracle.",
      "Debugging: Being the detective in a criminal movie where you are also the murderer.",
      "What is a web developer’s favorite drink? Java.",
      "Why did the JavaScript developer go to the party? To get some Node.js.",
      "Why did the coder bring a ladder to the bar? Because he wanted to climb the stack.",
      "Why did the software engineer hate working in a team? Because they couldn’t git along.",
      "How does a programmer deal with the weather? By using a weather API.",
      "Why do JavaScript developers make terrible friends? Because they keep blocking everything.",
      "What did the frontend developer say when he was asked to take a break? ‘I’m already in the middle of a div.’",
      "Why do developers hate nature? It has too many bugs.",
      "Why are assembly programmers always depressed? Because they can’t find a higher level.",
      "Why did the programmer cross the road? To refactor the other side.",
      "How do you comfort a JavaScript bug? You console it.",
      "Why don’t C programmers ever break up with their partners? They can’t handle pointers.",
      "I can’t believe I’m programming in C… I’ve fallen into a void.",
      "How do you know if a joke is really good? It’s recursive.",
      "Why do developers prefer coding at night? Because the sun’s not out to break their code.",
      "What did the C programmer say to the web developer? ‘Don’t forget to escape your strings!’",
      "Why do programmers hate tight deadlines? Because they always get caught in a race condition.",
      "What do you call a bug in your code? A feature.",
      "Why don’t software engineers trust elevators? They always let you down.",
      "Why did the developer take a nap? Because they needed to ‘rest’ their code.",
      "Why do developers prefer working from home? Because they don’t like dealing with the bugs in the office.",
      "What do you call an infinite loop? A good way to get stuck in your thoughts.",
      "What’s a developer’s least favorite word? ‘Deadline.’",
      "Why did the software developer sleep at work? Because he couldn’t handle all the exceptions.",
      "What do you call a developer who doesn’t test their code? A bug magnet.",
      "Why did the programmer quit his job? Because he didn’t get arrays.",
      "Why was the programmer so good at tennis? Because they knew how to serve.",
      "Why do developers hate regex? Because it’s like being in an abusive relationship with patterns.",
      "What do you call a function that doesn’t return? A dead end.",
      "Why do C++ programmers hate working with friends? Because they don’t trust pointers.",
      "Why did the coder become a farmer? Because he wanted to grow his own seed.",
      "How do you know a web developer is at a party? Don’t worry, they’ll tell you. And also provide a live demo.",
      "Why are SQL queries like the DMV? Because they always take forever.",
      "Why are C programmers afraid of the dark? Because they fear memory leaks.",
      "How does a developer say goodbye? ‘I’ll C you later.’",
      "Why do developers have a hard time with relationships? They keep trying to optimize them.",
      "Why do SQL developers always carry a map? Because they hate getting lost in their joins.",
      "Why do Java developers wear glasses? Because they don’t see sharp.",
      "A real programmer knows how to handle null pointers and exceptions.",
      "Why did the developer write a ‘Hello World’ program? To start their debugging journey.",
      "Why do PHP developers prefer pizza? Because it’s always in slices.",
      "Why did the machine learning engineer break up with their model? It wasn’t learning.",
      "What do you call an overloaded function? A busy signal.",
      "Why do coders love coffee? It helps them stay Java-fied.",
      "How do you fix a broken function? With a patch.",
      "Why don’t Python developers write good essays? They can’t deal with indentation.",
      "Why do programmers avoid cooking? Because they don’t want to deal with exceptions.",
      "What’s the fastest way to debug code? Remove one line at a time.",
      "Why did the database break up with the application? It couldn’t find a relationship.",
      "How many developers does it take to screw in a lightbulb? None. That’s a hardware problem.",
      "What did the software engineer say to the hardware engineer? ‘You’re the hardware, I’m the software.'",
      "Why did the developer refuse to leave the meeting? Because they couldn’t resolve the merge conflict.",
      "Why did the developer take a break from coding? To rest their source code.",
      "Why are assembly programmers always calm? They’re good at handling situations one instruction at a time.",
      "What’s the hardest part about programming? Getting the coffee right.",
      "Why did the front-end developer get lost? They couldn’t find the routes.",
      "Why do programmers never need to exercise? Because they already run loops.",
      "Why do Java developers hate writing emails? They don’t know how to handle exceptions.",
      "Why do Python programmers never fight? They can’t find the right indentation.",
      "What do you call an API that’s always working? A miracle.",
      "Why don’t developers work in the morning? Because they can’t function before coffee.",
      "Why are C programmers terrible at relationships? They can’t handle pointers.",
      "How did the developer end up in prison? For committing too many semicolons.",
      "Why did the algorithm go to therapy? It had too many loops.",
      "Why do software engineers wear black? Because the future is dark.",
      "What do you call a buggy code? A ‘feature.’",
      "Why do software engineers love music? Because they know how to debug beats.",
      "What’s the best way to learn programming? By writing code.",
      "Why do JavaScript programmers prefer to live in isolation? Because they don’t know how to handle async.",
      "What’s a programmer’s favorite place to live? In an infinite loop.",
      "What do you call a non-developer who tries to write code? A future programmer.",
      "Why did the coder bring a map to the meeting? Because they were lost in the code.",
      "What’s a developer’s favorite programming language? Whatever works.",
      "Why did the software engineer choose an island? Because they needed to isolate themselves.",
      "What do you call a buggy program? A feature.",
      "How do programmers deal with a hot drink? They always cache their coffee."
    ],
    "log_file_path": "/logs/file.log",
    "metrics_server": "localhost:9091"
}